"""
    元组
    练习：ｅｘｅｒｃｉｓｅ０２／０３
"""

# 1. 创建空元组
t01 = ()
t02 = tuple()

# 2. 创建具有默认值的元组
t01 = (1,2,3)
t01 = tuple("abcd")
t01 = (1,2,[4,5])
print(t01)

# 修改
# t01[2] = 100  元组元素不能修改
t01[2][0] = 100 # 修改的是元素第三个元素(列表)的元素．

# 3. 获取元素(索引　／　切片)
print(t01[:2])

# 获取元组所有元素
for item in t01:
    print(item)

# 倒序获取元组所有元素
for i in range(len(t01)-1, -1,-1):
    print(t01[i])


t02 = ("a","b")
l02 = ["a","b"]

t03 = t02
l03 = l02

t02 += ("c","d") # 创建了新元组对象，改变了t02存储的地址．
l02 += ["c","d"] # 将["c","d"]追加到原列表中．

print(t02) # ('a', 'b', 'c', 'd')
print(t03) # ('a', 'b')
print(l03) # ['a', 'b', 'c', 'd']


# 如果元组只有一个元素，必须多写一个逗号，否则视为普通对象，不是元组对象．
t04 = (1,)
print(t04)








