"""
    day05 复习
    容器
    　１．　字符串ｓｔｒ
            (1) 定义：由一系列字符组成的不可变序列．
            (2)字面值：''   ""    \"""
                    转义符：改变字符原始含义的特殊字符
                    字符串格式化：　　"..格%d式.."%(变量)

    　２．　列表　ｌｉｓｔ
            (1) 定义：由一系列变量组成的可变序列．
            (2) 操作：
            　　　创建:  []        　 list()
                      [1,2,3]    　 list(可迭代对象)
                添加：　列表名称.append(元素)
                　　　　列表名称.insert(索引,元素)
            　　 删除:  列表名称.remove(元素)
                       del 列表名称[索引]
                       del 列表名称[切片]
            　　修改：列表名称[索引]　=  元素　　
                    列表名称[切片]　= 列表
            　　查询：列表名称[索引]
            　　　　　列表名称[切片]
                定位：索引　　切片
"""