"""
    复习 day02
    1. 数据基本运算
        (1) 数据类型:整形int      浮点型float      字符串str      布尔bool
                    -4  0  5   -1.4  0.0  1.3     "5"       True   False
        (2) 类型转换
        (3) 运算符
           -- 算数+  -  *  /  //   %   **
           a + 1
           -- 增强=+  =-  =*  =/  =//   =%   =**
           a += 1
           -- 比较> <  >=  <=  ==  !=
           -- 逻辑 and      or    not
                 False    True
                  并且     或者    取反
           -- 身份 is    is not
                 变量1      is     变量2
                 id(变量1)  ==    id(变量2)
    2. 语句
           -- 选择语句
           if 条件1:
               满足条件1才执行的语句
           elif 条件2:
               不满足条件1
               满足条件2才执行的语句
           else:
               以上条件都不满足
"""











