"""
    day03 复习
    语句
        -- 选择语句
        if 条件1:
            满足条件1执行的语句
        elif 条件2:
            满足条件2执行的语句
        else:
            以上条件都不满足执行的语句

        -- 循环语句
            while 条件:
                满足条件重复执行的代码
            else:
                不满足条件执行的代码
                从break语句退出时不执行

            for 变量 in 字符串:
                print(变量) # 每个字符

            for 变量 in range(起始值,终止值,间隔):
                .....

            range(3) --> 0  1  2
            range(1,5) --> 1 2 3 4
            range(1,6,3) --> 1  4
            range(5,0,-1) --> 5  4  3  2  1

            适用性:while循环适合根据条件反复执行,不知道次数.
                  for 循环适合预定次数的执行.

        -- 跳转语句
           break --- 跳出循环
           continue --- 跳过本次,继续下次循环.
"""









